app/views/groups/index.html.erb

SELECT COUNT(*) FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 11]]
---
        <div class="event-details">
          <h3><%= group.memberships.count %> Members</h3>

SELECT COUNT(*) FROM "events" WHERE "events"."group_id" = $1  [["group_id", 11]]
---
        <div class="event-details">
          <% if group.events.count == 1 %>