app/views/courses/show.html.erb

        <div class="event-details">
          <p><%= @course.holes.count %></p>
---
SELECT "holes".* FROM "holes" WHERE "holes"."course_id" = $1  [["course_id", 4]]
SELECT COUNT(*) FROM "holes" WHERE "holes"."course_id" = $1  [["course_id", 4]]