app/controllers/holes_controller.rb

SELECT  "holes".* FROM "holes" WHERE "holes"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
---
  def show
    @hole = Hole.find(params[:id])